RTEMS/rtems/bsps/arm/imxrt/mcux-sdk/drivers/pwm/fsl_pwm.c
    /* Setup the signal to be passed upon occurrence of a FORCE_OUT signal */
    reg = base->DTSRCSEL;
    reg &= ~((uint16_t)0x3U << shift);
    reg |= (uint16_t)((uint16_t)mode << shift);
    base->DTSRCSEL = reg;
}

/*!
 * brief Enables the selected PWM interrupts
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param mask      The interrupts to enable. This is a logical OR of members of the
 *                  enumeration ::pwm_interrupt_enable_t
 */
void PWM_EnableInterrupts(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
    /* Upper 16 bits are for related to the submodule */
    base->SM[subModule].INTEN |= ((uint16_t)mask & 0xFFFFU);
    /* Fault related interrupts */
    base->FCTRL |= ((uint16_t)(mask >> 16U) & PWM_FCTRL_FIE_MASK);
}

/*!
 * brief Disables the selected PWM interrupts
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param mask      The interrupts to enable. This is a logical OR of members of the
 *                  enumeration ::pwm_interrupt_enable_t
 */
void PWM_DisableInterrupts(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
    base->SM[subModule].INTEN &= ~((uint16_t)mask & 0xFFFFU);
    base->FCTRL &= ~((uint16_t)(mask >> 16U) & PWM_FCTRL_FIE_MASK);
}

/*!
 * brief Gets the enabled PWM interrupts
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 *
 * return The enabled interrupts. This is the logical OR of members of the
 *         enumeration ::pwm_interrupt_enable_t
 */
uint32_t PWM_GetEnabledInterrupts(PWM_Type *base, pwm_submodule_t subModule)
{
    uint32_t enabledInterrupts;

    enabledInterrupts = base->SM[subModule].INTEN;
    enabledInterrupts |= (((uint32_t)base->FCTRL & PWM_FCTRL_FIE_MASK) << 16UL);
    return enabledInterrupts;
}

/*!
 * brief Gets the PWM status flags
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 *
 * return The status flags. This is the logical OR of members of the
 *         enumeration ::pwm_status_flags_t
 */
uint32_t PWM_GetStatusFlags(PWM_Type *base, pwm_submodule_t subModule)
{
    uint32_t statusFlags;

    statusFlags = base->SM[subModule].STS;
    statusFlags |= (((uint32_t)base->FSTS & PWM_FSTS_FFLAG_MASK) << 16UL);

    return statusFlags;
}

/*!
 * brief Clears the PWM status flags
 *
 * param base      PWM peripheral base address
 * param subModule PWM submodule to configure
 * param mask      The status flags to clear. This is a logical OR of members of the
 *                  enumeration ::pwm_status_flags_t
 */
void PWM_ClearStatusFlags(PWM_Type *base, pwm_submodule_t subModule, uint32_t mask)
{
    uint16_t reg;

    base->SM[subModule].STS = ((uint16_t)mask & 0xFFFFU);
    reg                     = base->FSTS;
    /* Clear the fault flags and set only the ones we wish to clear as the fault flags are cleared
     * by writing a login one
     */
    reg &= ~(uint16_t)(PWM_FSTS_FFLAG_MASK);
    reg |= (uint16_t)((mask >> 16U) & PWM_FSTS_FFLAG_MASK);
    base->FSTS = reg;
}

/*!
 * brief Set PWM output in idle status (high or low).
 *
 * note This API should call after PWM_SetupPwm() APIs, and PWMX submodule is not supported.
 *
 * param base               PWM peripheral base address
 * param pwmChannel         PWM channel to configure
 * param subModule          PWM submodule to configure
 * param idleStatus         True: PWM output is high in idle status; false: PWM output is low in idle status.
 *
 * return kStatus_Fail if there was error setting up the signal; kStatus_Success if set output idle success
 */
status_t PWM_SetOutputToIdle(PWM_Type *base, pwm_channels_t pwmChannel, pwm_submodule_t subModule, bool idleStatus)
{
    uint16_t valOn = 0, valOff = 0;
    uint16_t ldmod;

    /* Clear LDOK bit if it is set */
    if (0U != (base->MCTRL & PWM_MCTRL_LDOK(1UL << (uint8_t)subModule)))
    {
        base->MCTRL |= PWM_MCTRL_CLDOK(1UL << (uint8_t)subModule);
    }

    valOff = base->SM[subModule].INIT;
    valOn  = base->SM[subModule].VAL1 + 0x1U;

    if ((valOff + 1U) == valOn)
    {
        return kStatus_Fail;
    }

    /* Should not PWM_X channel */
    if (kPWM_PwmA == pwmChannel)
    {
        if (0U != (base->SM[subModule].OCTRL & PWM_OCTRL_POLA_MASK))
        {
            if (!idleStatus)
            {
                valOn  = base->SM[subModule].INIT;
                valOff = base->SM[subModule].VAL1 + 0x1U;
            }
        }
        else
        {
            if (idleStatus)
            {
                valOn  = base->SM[subModule].INIT;
                valOff = base->SM[subModule].VAL1 + 0x1U;
            }
        }
        base->SM[subModule].VAL2 = valOn;
        base->SM[subModule].VAL3 = valOff;
    }
    else if (kPWM_PwmB == pwmChannel)
    {
        if (0U != (base->SM[subModule].OCTRL & PWM_OCTRL_POLB_MASK))
        {
            if (!idleStatus)
            {
                valOn  = base->SM[subModule].INIT;
                valOff = base->SM[subModule].VAL1 + 0x1U;
            }
        }
        else
        {
            if (idleStatus)
            {
                valOn  = base->SM[subModule].INIT;
                valOff = base->SM[subModule].VAL1 + 0x1U;
            }
        }
        base->SM[subModule].VAL4 = valOn;
        base->SM[subModule].VAL5 = valOff;
    }
    else
    {
        return kStatus_Fail;
    }

    /* Record Load mode */
    ldmod = base->SM[subModule].CTRL;
    /* Set Load mode to make Buffered registers take effect immediately when LDOK bit set */
    base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;
    /* Set LDOK bit to load buffer registers */
    base->MCTRL |= PWM_MCTRL_LDOK(1UL << (uint8_t)subModule);
    /* Restore Load mode */
    base->SM[subModule].CTRL = ldmod;

    /* Get pwm duty cycle */
    s_pwmGetPwmDutyCycle[subModule][pwmChannel] = 0x0U;

    return kStatus_Success;
}

/*!
 * brief Get the dutycycle value.
 *
 * param base        PWM peripheral base address
 * param subModule   PWM submodule to configure
 * param pwmChannel  PWM channel to configure
 *
 * return Current channel dutycycle value.
 */
uint8_t PWM_GetPwmChannelState(PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmChannel)
{
#ifdef __rtems__
    (void) base;
#endif
    return s_pwmGetPwmDutyCycle[subModule][pwmChannel];
}

/*!
 * brief Set the pwm submodule prescaler.
 *
 * param base               PWM peripheral base address
 * param subModule          PWM submodule to configure
 * param prescaler          Set prescaler value
 */
void PWM_SetClockMode(PWM_Type *base, pwm_submodule_t subModule, pwm_clock_prescale_t prescaler)
{
    uint16_t reg = base->SM[subModule].CTRL;

    /* Clear LDOK bit if it is set */
    if (0U != (base->MCTRL & PWM_MCTRL_LDOK(1UL << (uint8_t)subModule)))
    {
        base->MCTRL |= PWM_MCTRL_CLDOK(1UL << (uint8_t)subModule);
    }
    /* Set submodule prescaler. */
    reg &= ~(uint16_t)PWM_CTRL_PRSC_MASK;
    reg |= PWM_CTRL_PRSC(prescaler);
    base->SM[subModule].CTRL = reg;
    /* Set Load mode to make Buffered registers take effect immediately when LDOK bit set */
    base->SM[subModule].CTRL |= PWM_CTRL_LDMOD_MASK;
    /* Set LDOK bit to load buffer registers */
    base->MCTRL |= PWM_MCTRL_LDOK(1UL << (uint8_t)subModule);
    /* Restore Load mode */
    base->SM[subModule].CTRL = reg;
}

/*!
 * brief This function enables-disables the forcing of the output of a given eFlexPwm channel to logic 0.
 *
 * param base               PWM peripheral base address
 * param pwmChannel         PWM channel to configure
 * param subModule          PWM submodule to configure
 * param forcetozero        True: Enable the pwm force output to zero; False: Disable the pwm output resumes normal
 *                          function.
 */
void PWM_SetPwmForceOutputToZero(PWM_Type *base, pwm_submodule_t subModule, pwm_channels_t pwmChannel, bool forcetozero)
{
    uint16_t reg = base->SM[subModule].CTRL2;
    uint16_t mask;

    if (kPWM_PwmA == pwmChannel)
    {
        mask = PWM_MASK_MASKA(0x01UL << (uint8_t)subModule);
    }
    else if (kPWM_PwmB == pwmChannel)
    {
        mask = PWM_MASK_MASKB(0x01UL << (uint8_t)subModule);
    }
    else
    {
        mask = PWM_MASK_MASKX(0x01UL << (uint8_t)subModule);
    }

    if (forcetozero)
    {
        /* Disables the channel output, forcing output level to 0 */
        base->MASK |= mask;
    }
    else
    {
        /* Enables the channel output */
        base->MASK &= ~mask;
    }

